tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "spotify/sptaps", "git@ghe.spotify.net:shared/homebrew-spotify.git"
brew "angle-grinder"
brew "python@3.9"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "go"
brew "dep"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "docker-completion"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "gmailctl"
brew "gnu-sed"
brew "libtool"
brew "nghttp2"
brew "unbound"
brew "gnupg"
brew "grpcurl"
brew "helm"
brew "httpie"
brew "ispell"
brew "jenv"
brew "jq"
brew "kind"
brew "krb5"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "maven"
brew "postgresql"
brew "protobuf"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vegeta"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "heroku/brew/heroku"
brew "instrumenta/instrumenta/kubeval"
brew "spotify/sptaps/hmtools"
brew "spotify/sptaps/protoman"
cask "1password-cli"
cask "alacritty"
cask "amethyst"
cask "anybar"
cask "corretto11"
cask "docker"
cask "emacs"
cask "google-cloud-sdk"
cask "wireshark"
cask "tuple"
cask "krisp"
cask "zsa-wally"
mas "Endel"
mas "HazeOver"
mas "MeetingBar"
mas "Amphetamine"
mas "Monodraw"
mas "Gestimer"
